In [ ]:
import pandas as pd

df = pd.read_csv('Desktop/Data Science/CSV Files/titanic.csv')
df

In [13]:
edit = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns')
edit.head(10)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500
5         0       3    male   NaN   8.4583
6         0       1    male  54.0  51.8625
7         0       3    male   2.0  21.0750
8         1       3  female  27.0  11.1333
9         1       2  female  14.0  30.0708

Dividing my dataframe into independent variables as ind and target variable as target.

In [18]:
ind= edit.drop(['Survived'], axis = 'columns')
ind.head(10)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500
5       3    male   NaN   8.4583
6       1    male  54.0  51.8625
7       3    male   2.0  21.0750
8       3  female  27.0  11.1333
9       2  female  14.0  30.0708

In [19]:
target = edit['Survived']
target.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [20]:
from sklearn.preprocessing import LabelEncoder
le_Pclass = LabelEncoder()
le_Sex = LabelEncoder()
le_Age = LabelEncoder()
le_Fare = LabelEncoder()

Now we create a new columns for each independent variable in the dataframe

In [23]:
ind['Pclass_n'] = le_Pclass.fit_transform(ind['Pclass'])
ind['Sex_n'] = le_Sex.fit_transform(ind['Sex'])
ind['Age_n'] = le_Age.fit_transform(ind['Age'])
ind['Fare'] = le_Fare.fit_transform(ind['Fare'])
ind.head(10)

   Pclass     Sex   Age  Fare  Pclass_n  Sex_n  Age_n
0       3    male  22.0    18         2      1     28
1       1  female  38.0   207         0      0     51
2       3  female  26.0    41         2      0     34
3       1  female  35.0   189         0      0     47
4       3    male  35.0    43         2      1     47
5       3    male   NaN    51         2      1     88
6       1    male  54.0   186         0      1     69
7       3    male   2.0   124         2      1      6
8       3  female  27.0    74         2      0     35
9       2  female  14.0   154         1      0     18

Rearrangement of the independent variable as final

In [25]:
final = ind.drop(['Pclass', 'Sex', 'Age', 'Fare'], axis = 'columns')
final.head(10)

   Pclass_n  Sex_n  Age_n
0         2      1     28
1         0      0     51
2         2      0     34
3         0      0     47
4         2      1     47
5         2      1     88
6         0      1     69
7         2      1      6
8         2      0     35
9         1      0     18

In [26]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(final,target)

DecisionTreeClassifier()

Score of my model.

In [27]:
model.score(final,target)

0.8799102132435466

Prediction for non survival

In [28]:
model.predict([[2,1,28]])

array([0], dtype=int64)

Predcition for survival.

In [29]:
model.predict([[1,0,1]])

array([1], dtype=int64)